<HTML>
	<TITLE>
	Filtres images
	</TITLE>
	
	<HEAD>
		<meta charset="iso-8859-15"><!-- incompatibilité de l'utf-8 avec le JQUERY combiné à TinyMCE -->
		<link rel="stylesheet" href="js/jquery-ui/jquery-ui.css">
 		<link href="css/style.css" rel="stylesheet" type="text/css"  media="screen"/>  		
		<link rel="stylesheet" href="css/font-awesome-4.3.0/css/font-awesome.min.css">
		<script src="js/jquery.js"></script>
		<script src="js/jquery-ui/jquery-ui.js"></script>
		<!-- <link rel="stylesheet" href="/resources/demos/style.css"> -->
		<!-- TinyMCE -->
		<script type="text/javascript" src="js/tinymce/tinymce.min.js"></script>
		<script type="text/javascript">
		tinymce.init({
			language : "fr_FR",
			plugins: "code",
			mode : "specific_textareas",
			editor_selector : "resultat",
			width: "100%",
			height: "60%"
		 });
		</script>
		<!------------->
	</HEAD>
	
	<BODY style="overflow: scroll;">
		
		
		<div id="content">
			<div id="titre"><!-- Titre/Logo -->
				<img src="img/logo.png" alt="Stéganographie ISN" id="logo">
			</div>			
			
			<div style="position:relative;width:100%;background-color:white;border-radius:8px;height:200%;">
				<div class="div-title">
					<p>A Propos de la Steganographie</p>
				</div>
				<div class="div-content" style="padding-top:50px;">
					<div id="histoire">
					
						<H4 class="histoiress"> Le cryptage </BR> </H4> 

						<UL class="histoire-content"> 
							<LI> La cryptographie, ou art de chiffrer, coder les messages, est devenue aujourd'hui une science &#224; part enti&#232;re. Au croisement des math&#233;matiques, de l'informatique, et parfois m&#234;me de la physique, elle permet ce dont les civilisations ont besoin depuis qu'elles existent : le maintien du secret. Pour &#233;viter une guerre, prot&#233;ger un peuple, il est parfois n&#233;cessaire de cacher des choses... </LI> </BR> 
							
							<LI>  La cryptologie est la "science du secret", et regroupe deux branches : d'une part, la cryptographie, qui permet de coder les messages, et d'autre part, la cryptanalyse, qui permet de les d&#233;coder. </LI> </BR> 
						</UL>

						<H4 class="histoire-titre"> Un peu d'Histoire... </BR> </H4> 

						<UL class="histoire-content"> 

							<LI> Le terme &#171; chiffrement &#187; est utilis&#233; depuis le XVIIe si&#232;cle dans le sens de chiffrer un message. L'op&#233;ration inverse, qui suppose que l'on connaisse la cl&#233;, est donc le &#171; d&#233;chiffrement &#187;. Le terme de d&#233;cryptage est r&#233;serv&#233;e &#224; l'action de casser un message chiffr&#233; sans conna&#238;tre la cl&#233;. </LI>

							<LI> Le terme &#171; cryptage &#187; et ses d&#233;riv&#233;s viennent du grec ancien, kruptos, &#171; cach&#233;, secret &#187;. </LI> 
							
						</UL> 

						<H4 class="histoire-titre"> Niveau informatique </BR> </H4> 

						<UL class="histoire-content"> 
							
							<LI> Le chiffrement ou cryptage est un proc&#233;d&#233; de cryptographie gr&#226;ce auquel on souhaite rendre la compr&#233;hension d'un document impossible &#224; toute personne qui n'a pas la cl&#233; de (d&#233;)chiffrement.</LI>
							
						</BR> 

							<LI> 
							Les op&#233;rations de chiffrement et de codage font partie de la th&#233;orie de l'information et de la th&#233;orie des codes. </BR> 
							 - La diff&#233;rence essentielle r&#233;side dans la volont&#233; de prot&#233;ger les informations et d'emp&#234;cher des tierces personnes d'acc&#233;der aux donn&#233;es dans le cas du chiffrement. </BR>
							 - Le codage consiste &#224; transformer de l'information (des donn&#233;es) vers un ensemble de mots. Chacun de ces mots est constitu&#233; de symboles. La compression est un codage : on transforme les donn&#233;es vers un ensemble de mots ad&#233;quats destin&#233;s &#224; r&#233;duire la taille mais il n'y a pas de volont&#233; de dissimuler (bien que cela se fasse implicitement en rendant plus difficile d'acc&#232;s le contenu).
							</LI>
						</UL>
					
						
						<H4 class="histoire-titre"> La st&#233;ganographie a commenc&#233; bien avant l'informatique </BR> </H4> 

						<UL class="histoire-content"> 

								<LI> Prenons comme exemple la lettre de George Sand qui fut attribu&#233; &#224; Alfred de Musset. En la lisant normalement nous ne remarquons rien mais lorsque nous la lisons une ligne sur deux... Le texte original en r&#233;v&#232;le un autre. </LI> </BR> 
							"Cher ami,
							Je suis toute &#233;mue de vous dire que j'ai</BR>
							bien compris l'autre jour que vous aviez</BR>
							toujours une envie folle de me faire</BR>
							danser. Je garde le souvenir de votre</BR>
							baiser et je voudrais bien que ce soit</BR>
							une preuve que je puisse &#234;tre aim&#233;e</BR>
							par vous. Je suis pr&#234;te &#224; montrer mon</BR>
							affection toute d&#233;sint&#233;ress&#233;e et sans cal-</BR>
							cul, et si vous voulez me voir ainsi</BR>
							vous d&#233;voiler, sans artifice, mon &#226;me</BR>
							toute nue, daignez me faire visite,</BR>
							nous causerons et en amis franchement</BR>
							je vous prouverai que je suis la femme</BR>
							sinc&#232;re, capable de vous offrir l'affection</BR>
							la plus profonde, comme la plus &#233;troite</BR>
							amiti&#233;, en un mot : la meilleure &#233pouse</BR>
							dont vous puissiez r&#234;ver. Puisque votre</BR>
							&#226;me est libre, pensez que l'abandon ou je</BR>
							vis est bien long, bien dur et souvent bien</BR>
							insupportable. Mon chagrin est trop</BR>
							gros. Accourrez bien vite et venez me la</BR>
							faire oublier. &#192; vous je veux me sou- </BR>
							mettre enti&#232;rement.</BR>
							Votre poup&#233;e." </BR> </BR> 
								
								<LI> De m&#234;me pour la lettre de Musset addres&#233;e &#224; Goerge Sand. Cette fois-ci il faut lire le premier mot de chaque ligne. </LI> </BR> 
							"Quand je mets &#224; vos pieds un &#233;ternel hommage, </BR>
							Voulez-vous qu'un instant je change de visage ? </BR>
							Vous avez captur&#233; les sentiments d'un coeur</BR>
							Que pour vous adorer forma le cr&#233;ateur.</BR>
							Je vous ch&#233;ris, amour, et ma plume en d&#233;lire</BR>
							Couche sur le papier ce que je n'ose dire.</BR>
							Avec soin de mes vers lisez les premiers mots, </BR>
							Vous saurez quel rem&#232;de apporter &#224; mes maux."</BR>
						</UL>

					</div>		
					<div><a href="index.html"class="button"><p><i class="fa fa-home fa-x"></i> Retourner sur la page principale</p></a></div>
				</div>
			</div>
			
			
		</div>
		
		
	</BODY>
	
	
</HTML>
